Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH00/include/pic32cm5164jh00048.h
#define FLASH_SIZE                     _UL_(0x00080000)    /*  512kB Memory segment type: flash */
#define FLASH_PAGE_SIZE                _UL_(        64)
#define FLASH_NB_OF_PAGES              _UL_(      8192)

#define CAL_SIZE                       _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define LOCKBIT_SIZE                   _UL_(0x00000004)    /*    0kB Memory segment type: fuses */
#define OTP1_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP2_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP3_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP4_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP5_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define TEMP_LOG_SIZE                  _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define USER_PAGE_SIZE                 _UL_(0x00000100)    /*    0kB Memory segment type: user_page */
#define USER_PAGE_PAGE_SIZE            _UL_(        64)
#define USER_PAGE_NB_OF_PAGES          _UL_(         4)

#define DATAFLASH_SIZE                 _UL_(0x00002000)    /*    8kB Memory segment type: flash */
#define DATAFLASH_PAGE_SIZE            _UL_(        64)
#define DATAFLASH_NB_OF_PAGES          _UL_(       128)

#define DRAM_SIZE                      _UL_(0x00010000)    /*   64kB Memory segment type: ram */
#define HPB0_SIZE                      _UL_(0x00004000)    /*   16kB Memory segment type: io */
#define HPB1_SIZE                      _UL_(0x00010000)    /*   64kB Memory segment type: io */
#define HPB2_SIZE                      _UL_(0x00008000)    /*   32kB Memory segment type: io */
#define HPB3_SIZE                      _UL_(0x00001800)    /*    6kB Memory segment type: io */
#define DIVAS_SIZE                     _UL_(0x00000020)    /*    0kB Memory segment type: io */
#define PPB_SIZE                       _UL_(0x00100000)    /* 1024kB Memory segment type: io */

#define FLASH_ADDR                     _UL_(0x00000000)    /* FLASH base address (type: flash)*/
#define CAL_ADDR                       _UL_(0x00800000)    /* CAL base address (type: fuses)*/
#define LOCKBIT_ADDR                   _UL_(0x00802000)    /* LOCKBIT base address (type: fuses)*/
#define OTP1_ADDR                      _UL_(0x00806000)    /* OTP1 base address (type: fuses)*/
#define OTP2_ADDR                      _UL_(0x00806008)    /* OTP2 base address (type: fuses)*/
#define OTP3_ADDR                      _UL_(0x00806010)    /* OTP3 base address (type: fuses)*/
#define OTP4_ADDR                      _UL_(0x00806018)    /* OTP4 base address (type: fuses)*/
#define OTP5_ADDR                      _UL_(0x00806020)    /* OTP5 base address (type: fuses)*/
#define TEMP_LOG_ADDR                  _UL_(0x00806030)    /* TEMP_LOG base address (type: fuses)*/
#define USER_PAGE_ADDR                 _UL_(0x00804000)    /* USER_PAGE base address (type: user_page)*/
#define DATAFLASH_ADDR                 _UL_(0x00400000)    /* DATAFLASH base address (type: flash)*/
#define DRAM_ADDR                      _UL_(0x20000000)    /* DRAM base address (type: ram)*/
#define HPB0_ADDR                      _UL_(0x40000000)    /* HPB0 base address (type: io)*/
#define HPB1_ADDR                      _UL_(0x41000000)    /* HPB1 base address (type: io)*/
#define HPB2_ADDR                      _UL_(0x42000000)    /* HPB2 base address (type: io)*/
#define HPB3_ADDR                      _UL_(0x43000000)    /* HPB3 base address (type: io)*/
#define DIVAS_ADDR                     _UL_(0x48000000)    /* DIVAS base address (type: io)*/
#define PPB_ADDR                       _UL_(0xe0000000)    /* PPB base address (type: io)*/

/* ************************************************************************** */
/*   DEVICE SIGNATURES FOR PIC32CM5164JH00048                                 */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UL_(0X11060014)

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR PIC32CM5164JH00048                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* Event Generator IDs for C32CM5164JH00048 */
/* ************************************************************************** */
#define EVENT_ID_GEN_RTC_PERD                             1 /* ID for RTC event generator PERD */
#define EVENT_ID_GEN_OSCCTRL_XOSC_FAIL                    3 /* ID for OSCCTRL event generator XOSC_FAIL */
#define EVENT_ID_GEN_OSC32KCTRL_XOSC32K_FAIL              4 /* ID for OSC32KCTRL event generator XOSC32K_FAIL */
#define EVENT_ID_GEN_RTC_CMP_0                            5 /* ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                            6 /* ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_OVF                              7 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_RTC_PER_0                            8 /* ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            9 /* ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                           10 /* ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                           11 /* ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                           12 /* ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                           13 /* ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           14 /* ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           15 /* ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_EIC_EXTINT_0                        16 /* ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        17 /* ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        18 /* ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        19 /* ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        20 /* ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        21 /* ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        22 /* ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        23 /* ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_EIC_EXTINT_8                        24 /* ID for EIC event generator EXTINT_8 */
#define EVENT_ID_GEN_EIC_EXTINT_9                        25 /* ID for EIC event generator EXTINT_9 */
#define EVENT_ID_GEN_EIC_EXTINT_10                       26 /* ID for EIC event generator EXTINT_10 */
#define EVENT_ID_GEN_EIC_EXTINT_11                       27 /* ID for EIC event generator EXTINT_11 */
#define EVENT_ID_GEN_EIC_EXTINT_12                       28 /* ID for EIC event generator EXTINT_12 */
#define EVENT_ID_GEN_EIC_EXTINT_13                       29 /* ID for EIC event generator EXTINT_13 */
#define EVENT_ID_GEN_EIC_EXTINT_14                       30 /* ID for EIC event generator EXTINT_14 */
#define EVENT_ID_GEN_EIC_EXTINT_15                       31 /* ID for EIC event generator EXTINT_15 */
#define EVENT_ID_GEN_DMAC_CH_0                           32 /* ID for DMAC event generator CH_0 */
#define EVENT_ID_GEN_DMAC_CH_1                           33 /* ID for DMAC event generator CH_1 */
#define EVENT_ID_GEN_DMAC_CH_2                           34 /* ID for DMAC event generator CH_2 */
#define EVENT_ID_GEN_DMAC_CH_3                           35 /* ID for DMAC event generator CH_3 */
#define EVENT_ID_GEN_TCC0_OVF                            36 /* ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC0_TRG                            37 /* ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            38 /* ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MC_0                           39 /* ID for TCC0 event generator MC_0 */
#define EVENT_ID_GEN_TCC0_MC_1                           40 /* ID for TCC0 event generator MC_1 */
#define EVENT_ID_GEN_TCC0_MC_2                           41 /* ID for TCC0 event generator MC_2 */
#define EVENT_ID_GEN_TCC0_MC_3                           42 /* ID for TCC0 event generator MC_3 */
#define EVENT_ID_GEN_TCC1_OVF                            43 /* ID for TCC1 event generator OVF */
#define EVENT_ID_GEN_TCC1_TRG                            44 /* ID for TCC1 event generator TRG */
#define EVENT_ID_GEN_TCC1_CNT                            45 /* ID for TCC1 event generator CNT */
#define EVENT_ID_GEN_TCC1_MC_0                           46 /* ID for TCC1 event generator MC_0 */
#define EVENT_ID_GEN_TCC1_MC_1                           47 /* ID for TCC1 event generator MC_1 */
#define EVENT_ID_GEN_TCC2_OVF                            48 /* ID for TCC2 event generator OVF */
#define EVENT_ID_GEN_TCC2_TRG                            49 /* ID for TCC2 event generator TRG */
#define EVENT_ID_GEN_TCC2_CNT                            50 /* ID for TCC2 event generator CNT */
#define EVENT_ID_GEN_TCC2_MC_0                           51 /* ID for TCC2 event generator MC_0 */
#define EVENT_ID_GEN_TCC2_MC_1                           52 /* ID for TCC2 event generator MC_1 */
#define EVENT_ID_GEN_TC0_OVF                             53 /* ID for TC0 event generator OVF */
#define EVENT_ID_GEN_TC0_MC_0                            54 /* ID for TC0 event generator MC_0 */
#define EVENT_ID_GEN_TC0_MC_1                            55 /* ID for TC0 event generator MC_1 */
#define EVENT_ID_GEN_TC1_OVF                             56 /* ID for TC1 event generator OVF */
#define EVENT_ID_GEN_TC1_MC_0                            57 /* ID for TC1 event generator MC_0 */
#define EVENT_ID_GEN_TC1_MC_1                            58 /* ID for TC1 event generator MC_1 */
#define EVENT_ID_GEN_TC2_OVF                             59 /* ID for TC2 event generator OVF */
#define EVENT_ID_GEN_TC2_MC_0                            60 /* ID for TC2 event generator MC_0 */
#define EVENT_ID_GEN_TC2_MC_1                            61 /* ID for TC2 event generator MC_1 */
#define EVENT_ID_GEN_TC3_OVF                             62 /* ID for TC3 event generator OVF */
#define EVENT_ID_GEN_TC3_MC_0                            63 /* ID for TC3 event generator MC_0 */
#define EVENT_ID_GEN_TC3_MC_1                            64 /* ID for TC3 event generator MC_1 */
#define EVENT_ID_GEN_TC4_OVF                             65 /* ID for TC4 event generator OVF */
#define EVENT_ID_GEN_TC4_MC_0                            66 /* ID for TC4 event generator MC_0 */
#define EVENT_ID_GEN_TC4_MC_1                            67 /* ID for TC4 event generator MC_1 */
#define EVENT_ID_GEN_ADC0_RESRDY                         68 /* ID for ADC0 event generator RESRDY */
#define EVENT_ID_GEN_ADC0_WINMON                         69 /* ID for ADC0 event generator WINMON */
#define EVENT_ID_GEN_ADC1_RESRDY                         70 /* ID for ADC1 event generator RESRDY */
#define EVENT_ID_GEN_ADC1_WINMON                         71 /* ID for ADC1 event generator WINMON */
#define EVENT_ID_GEN_AC_COMP_0                           72 /* ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                           73 /* ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_COMP_2                           74 /* ID for AC event generator COMP_2 */
#define EVENT_ID_GEN_AC_COMP_3                           75 /* ID for AC event generator COMP_3 */
#define EVENT_ID_GEN_AC_WIN_0                            76 /* ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_AC_WIN_1                            77 /* ID for AC event generator WIN_1 */
#define EVENT_ID_GEN_DAC_EMPTY                           78 /* ID for DAC event generator EMPTY */
#define EVENT_ID_GEN_PTC_EOC                             79 /* ID for PTC event generator EOC */
#define EVENT_ID_GEN_PTC_WCOMP                           80 /* ID for PTC event generator WCOMP */
#define EVENT_ID_GEN_CCL_LUTOUT_0                        81 /* ID for CCL event generator LUTOUT_0 */
#define EVENT_ID_GEN_CCL_LUTOUT_1                        82 /* ID for CCL event generator LUTOUT_1 */
#define EVENT_ID_GEN_CCL_LUTOUT_2                        83 /* ID for CCL event generator LUTOUT_2 */
#define EVENT_ID_GEN_CCL_LUTOUT_3                        84 /* ID for CCL event generator LUTOUT_3 */
#define EVENT_ID_GEN_PAC_ACCERR                          85 /* ID for PAC event generator ACCERR */
#define EVENT_ID_GEN_TC5_OVF                             87 /* ID for TC5 event generator OVF */
#define EVENT_ID_GEN_TC5_MC_0                            88 /* ID for TC5 event generator MC_0 */
#define EVENT_ID_GEN_TC5_MC_1                            89 /* ID for TC5 event generator MC_1 */
#define EVENT_ID_GEN_TC6_OVF                             90 /* ID for TC6 event generator OVF */
#define EVENT_ID_GEN_TC6_MC_0                            91 /* ID for TC6 event generator MC_0 */
#define EVENT_ID_GEN_TC6_MC_1                            92 /* ID for TC6 event generator MC_1 */
#define EVENT_ID_GEN_TC7_OVF                             93 /* ID for TC7 event generator OVF */
#define EVENT_ID_GEN_TC7_MC_0                            94 /* ID for TC7 event generator MC_0 */
#define EVENT_ID_GEN_TC7_MC_1                            95 /* ID for TC7 event generator MC_1 */
#define EVENT_ID_GEN_PDEC_OVF                            96 /* ID for PDEC event generator OVF */
#define EVENT_ID_GEN_PDEC_ERR                            97 /* ID for PDEC event generator ERR */
#define EVENT_ID_GEN_PDEC_DIR                            98 /* ID for PDEC event generator DIR */
#define EVENT_ID_GEN_PDEC_VLC                            99 /* ID for PDEC event generator VLC */
#define EVENT_ID_GEN_PDEC_MC_0                          100 /* ID for PDEC event generator MC_0 */
#define EVENT_ID_GEN_PDEC_MC_1                          101 /* ID for PDEC event generator MC_1 */

/* ************************************************************************** */
/*  Event User IDs for C32CM5164JH00048 */
/* ************************************************************************** */
#define EVENT_ID_USER_PORT_EV_0                           1 /* ID for PORT event user EV_0 */
#define EVENT_ID_USER_PORT_EV_1                           2 /* ID for PORT event user EV_1 */
#define EVENT_ID_USER_PORT_EV_2                           3 /* ID for PORT event user EV_2 */
#define EVENT_ID_USER_PORT_EV_3                           4 /* ID for PORT event user EV_3 */
#define EVENT_ID_USER_DMAC_CH_0                           5 /* ID for DMAC event user CH_0 */
#define EVENT_ID_USER_DMAC_CH_1                           6 /* ID for DMAC event user CH_1 */
#define EVENT_ID_USER_DMAC_CH_2                           7 /* ID for DMAC event user CH_2 */
#define EVENT_ID_USER_DMAC_CH_3                           8 /* ID for DMAC event user CH_3 */
#define EVENT_ID_USER_TCC0_EV_0                           9 /* ID for TCC0 event user EV_0 */
#define EVENT_ID_USER_TCC0_EV_1                          10 /* ID for TCC0 event user EV_1 */
#define EVENT_ID_USER_TCC0_MC_0                          11 /* ID for TCC0 event user MC_0 */
#define EVENT_ID_USER_TCC0_MC_1                          12 /* ID for TCC0 event user MC_1 */
#define EVENT_ID_USER_TCC0_MC_2                          13 /* ID for TCC0 event user MC_2 */
#define EVENT_ID_USER_TCC0_MC_3                          14 /* ID for TCC0 event user MC_3 */
#define EVENT_ID_USER_TCC1_EV_0                          15 /* ID for TCC1 event user EV_0 */
#define EVENT_ID_USER_TCC1_EV_1                          16 /* ID for TCC1 event user EV_1 */
#define EVENT_ID_USER_TCC1_MC_0                          17 /* ID for TCC1 event user MC_0 */
#define EVENT_ID_USER_TCC1_MC_1                          18 /* ID for TCC1 event user MC_1 */
#define EVENT_ID_USER_TCC2_EV_0                          19 /* ID for TCC2 event user EV_0 */
#define EVENT_ID_USER_TCC2_EV_1                          20 /* ID for TCC2 event user EV_1 */
#define EVENT_ID_USER_TCC2_MC_0                          21 /* ID for TCC2 event user MC_0 */
#define EVENT_ID_USER_TCC2_MC_1                          22 /* ID for TCC2 event user MC_1 */
#define EVENT_ID_USER_TC0_EVU                            23 /* ID for TC0 event user EVU */
#define EVENT_ID_USER_TC1_EVU                            24 /* ID for TC1 event user EVU */
#define EVENT_ID_USER_TC2_EVU                            25 /* ID for TC2 event user EVU */
#define EVENT_ID_USER_TC3_EVU                            26 /* ID for TC3 event user EVU */
#define EVENT_ID_USER_TC4_EVU                            27 /* ID for TC4 event user EVU */
#define EVENT_ID_USER_ADC0_START                         28 /* ID for ADC0 event user START */
#define EVENT_ID_USER_ADC0_SYNC                          29 /* ID for ADC0 event user SYNC */
#define EVENT_ID_USER_ADC1_START                         30 /* ID for ADC1 event user START */
#define EVENT_ID_USER_ADC1_SYNC                          31 /* ID for ADC1 event user SYNC */
#define EVENT_ID_USER_AC_SOC_0                           32 /* ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           33 /* ID for AC event user SOC_1 */
#define EVENT_ID_USER_AC_SOC_2                           34 /* ID for AC event user SOC_2 */
#define EVENT_ID_USER_AC_SOC_3                           35 /* ID for AC event user SOC_3 */
#define EVENT_ID_USER_DAC_START                          36 /* ID for DAC event user START */
#define EVENT_ID_USER_PTC_STCONV                         37 /* ID for DAC event user PTC_STCONV */
#define EVENT_ID_USER_CCL_LUTIN_0                        38 /* ID for CCL event user LUTIN_0 */
#define EVENT_ID_USER_CCL_LUTIN_1                        39 /* ID for CCL event user LUTIN_1 */
#define EVENT_ID_USER_CCL_LUTIN_2                        40 /* ID for CCL event user LUTIN_2 */
#define EVENT_ID_USER_CCL_LUTIN_3                        41 /* ID for CCL event user LUTIN_3 */
#define EVENT_ID_USER_MTB_START                          43 /* ID for MTB event user START */
#define EVENT_ID_USER_MTB_STOP                           44 /* ID for MTB event user STOP */
#define EVENT_ID_USER_TC5_EVU                            45 /* ID for TC5 event user EVU */
#define EVENT_ID_USER_TC6_EVU                            46 /* ID for TC6 event user EVU */
#define EVENT_ID_USER_TC7_EVU                            47 /* ID for TC7 event user EVU */
#define EVENT_ID_USER_PDEC_EVU_0                         48 /* ID for PDEC event user EVU_0 */
#define EVENT_ID_USER_PDEC_EVU_1                         49 /* ID for PDEC event user EVU_1 */
#define EVENT_ID_USER_PDEC_EVU_2                         50 /* ID for PDEC event user EVU_2 */

#ifdef __cplusplus
}
#endif

#endif /* _PIC32CM5164JH00048_H_ */

